*** crates/ccog/src/admit.rs:105:5: replace commit_masked_u64 -> u64 with 1

*** mutation diff:
--- crates/ccog/src/admit.rs
+++ replace commit_masked_u64 -> u64 with 1
@@ -97,18 +97,17 @@
 /// ```
 ///
 /// When admitted: `m == 0`, so `!m == u64::MAX`, and the expression reduces to
 /// `(value & u64::MAX) | (fallback & 0) == value`. When denied: `m == u64::MAX`,
 /// so `!m == 0`, and the expression reduces to `fallback`.
 #[must_use]
 #[inline(always)]
 pub const fn commit_masked_u64(verdict: u64, value: u64, fallback: u64) -> u64 {
-    let m = bool_mask(admitted(verdict));
-    (value & !m) | (fallback & m)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Branchless select between two `bool` values driven by `verdict`.
 ///
 /// Derived from [`commit_masked_u64`] by reinterpreting each `bool` as `u64`
 /// (`0` or `1`) and converting the result back via `!= 0`. Returns `value`
 /// when admitted and `fallback` when denied.
 #[must_use]

---- admit::tests::commit_masked_bool_selects_correctly stdout ----

thread 'admit::tests::commit_masked_bool_selects_correctly' (8740611) panicked at crates/ccog/src/admit.rs:209:9:
assertion failed: !commit_masked_bool(0, false, true)

---- admit::tests::commit_masked_u64_selects_value_when_admitted stdout ----

thread 'admit::tests::commit_masked_u64_selects_value_when_admitted' (8740614) panicked at crates/ccog/src/admit.rs:192:9:
assertion `left == right` failed
  left: 1
 right: 42

---- admit::tests::commit_masked_u64_selects_fallback_when_denied stdout ----

thread 'admit::tests::commit_masked_u64_selects_fallback_when_denied' (8740613) panicked at crates/ccog/src/admit.rs:200:9:
assertion `left == right` failed
  left: 1
 right: 99

failures:
    admit::tests::commit_masked_bool_selects_correctly
    admit::tests::commit_masked_u64_selects_fallback_when_denied
    admit::tests::commit_masked_u64_selects_value_when_admitted

test result: FAILED. 214 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.63s

*** result: Failure(101)
