*** crates/ccog/src/admit.rs:106:18: replace | with ^ in commit_masked_u64

*** mutation diff:
--- crates/ccog/src/admit.rs
+++ replace | with ^ in commit_masked_u64
@@ -98,17 +98,17 @@
 ///
 /// When admitted: `m == 0`, so `!m == u64::MAX`, and the expression reduces to
 /// `(value & u64::MAX) | (fallback & 0) == value`. When denied: `m == u64::MAX`,
 /// so `!m == 0`, and the expression reduces to `fallback`.
 #[must_use]
 #[inline(always)]
 pub const fn commit_masked_u64(verdict: u64, value: u64, fallback: u64) -> u64 {
     let m = bool_mask(admitted(verdict));
-    (value & !m) | (fallback & m)
+    (value & !m) ^ /* ~ changed by cargo-mutants ~ */ (fallback & m)
 }
 
 /// Branchless select between two `bool` values driven by `verdict`.
 ///
 /// Derived from [`commit_masked_u64`] by reinterpreting each `bool` as `u64`
 /// (`0` or `1`) and converting the result back via `!= 0`. Returns `value`
 /// when admitted and `fallback` when denied.
 #[must_use]

*** result: Success
