*** crates/ccog/src/admit.rs:106:30: replace & with ^ in commit_masked_u64

*** mutation diff:
--- crates/ccog/src/admit.rs
+++ replace & with ^ in commit_masked_u64
@@ -98,17 +98,17 @@
 ///
 /// When admitted: `m == 0`, so `!m == u64::MAX`, and the expression reduces to
 /// `(value & u64::MAX) | (fallback & 0) == value`. When denied: `m == u64::MAX`,
 /// so `!m == 0`, and the expression reduces to `fallback`.
 #[must_use]
 #[inline(always)]
 pub const fn commit_masked_u64(verdict: u64, value: u64, fallback: u64) -> u64 {
     let m = bool_mask(admitted(verdict));
-    (value & !m) | (fallback & m)
+    (value & !m) | (fallback ^ /* ~ changed by cargo-mutants ~ */ m)
 }
 
 /// Branchless select between two `bool` values driven by `verdict`.
 ///
 /// Derived from [`commit_masked_u64`] by reinterpreting each `bool` as `u64`
 /// (`0` or `1`) and converting the result back via `!= 0`. Returns `value`
 /// when admitted and `fallback` when denied.
 #[must_use]

---- admit::tests::commit_masked_u64_selects_value_when_admitted stdout ----

thread 'admit::tests::commit_masked_u64_selects_value_when_admitted' (8770831) panicked at crates/ccog/src/admit.rs:193:9:
assertion `left == right` failed
  left: 107
 right: 42

---- admit::tests::commit_masked_u64_selects_fallback_when_denied stdout ----

thread 'admit::tests::commit_masked_u64_selects_fallback_when_denied' (8770830) panicked at crates/ccog/src/admit.rs:201:9:
assertion `left == right` failed
  left: 18446744073709551516
 right: 99

---- admit::tests::commit_masked_bool_selects_correctly stdout ----

thread 'admit::tests::commit_masked_bool_selects_correctly' (8770828) panicked at crates/ccog/src/admit.rs:210:9:
assertion failed: !commit_masked_bool(0, false, true)

failures:
    admit::tests::commit_masked_bool_selects_correctly
    admit::tests::commit_masked_u64_selects_fallback_when_denied
    admit::tests::commit_masked_u64_selects_value_when_admitted

test result: FAILED. 214 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.55s

*** result: Failure(101)
