*** crates/ccog/src/admit.rs:117:5: replace commit_masked_bool -> bool with true

*** mutation diff:
--- crates/ccog/src/admit.rs
+++ replace commit_masked_bool -> bool with true
@@ -109,17 +109,17 @@
 /// Branchless select between two `bool` values driven by `verdict`.
 ///
 /// Derived from [`commit_masked_u64`] by reinterpreting each `bool` as `u64`
 /// (`0` or `1`) and converting the result back via `!= 0`. Returns `value`
 /// when admitted and `fallback` when denied.
 #[must_use]
 #[inline(always)]
 pub const fn commit_masked_bool(verdict: u64, value: bool, fallback: bool) -> bool {
-    commit_masked_u64(verdict, value as u64, fallback as u64) != 0
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Generic select between two `Copy` values driven by `verdict`.
 ///
 /// Returns `value` when admitted, otherwise `fallback`. This function is *not*
 /// `const fn` because trait-bounded generics over arbitrary `Copy` types are
 /// not yet stable in `const` context. The body is a plain `if`/`else`, which
 /// LLVM consistently lowers to a conditional move (`cmov`) for primitive

---- admit::tests::commit_masked_bool_selects_correctly stdout ----

thread 'admit::tests::commit_masked_bool_selects_correctly' (8774941) panicked at crates/ccog/src/admit.rs:210:9:
assertion failed: !commit_masked_bool(0, false, true)

failures:
    admit::tests::commit_masked_bool_selects_correctly

test result: FAILED. 216 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.57s

*** result: Failure(101)
