*** crates/ccog/src/admit.rs:47:5: replace bool_mask -> u64 with 0

*** mutation diff:
--- crates/ccog/src/admit.rs
+++ replace bool_mask -> u64 with 0
@@ -39,17 +39,17 @@
 ///
 /// ```ignore
 /// assert_eq!(admit::bool_mask(true), 0);
 /// assert_eq!(admit::bool_mask(false), u64::MAX);
 /// ```
 #[must_use]
 #[inline(always)]
 pub const fn bool_mask(condition: bool) -> u64 {
-    0u64.wrapping_sub((!condition) as u64)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Composes two admission verdicts via bitwise OR.
 ///
 /// The result is admitted (`0`) iff *both* inputs are admitted; otherwise the
 /// denial bits propagate.
 #[must_use]
 #[inline(always)]

---- admit::tests::bool_mask_denied_is_all_ones stdout ----

thread 'admit::tests::bool_mask_denied_is_all_ones' (8631007) panicked at crates/ccog/src/admit.rs:151:9:
assertion `left == right` failed
  left: 0
 right: 18446744073709551615

---- admit::tests::commit_masked_u64_selects_fallback_when_denied stdout ----

thread 'admit::tests::commit_masked_u64_selects_fallback_when_denied' (8631010) panicked at crates/ccog/src/admit.rs:201:9:
assertion `left == right` failed
  left: 42
 right: 99

---- admit::tests::commit_masked_bool_selects_correctly stdout ----

thread 'admit::tests::commit_masked_bool_selects_correctly' (8631008) panicked at crates/ccog/src/admit.rs:211:9:
assertion failed: !commit_masked_bool(1, true, false)

failures:
    admit::tests::bool_mask_denied_is_all_ones
    admit::tests::commit_masked_bool_selects_correctly
    admit::tests::commit_masked_u64_selects_fallback_when_denied
    construct8::tests::push_to_capacity_succeeds

test result: FAILED. 213 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.71s

*** result: Failure(101)
