*** crates/ccog/src/admit.rs:47:5: replace bool_mask -> u64 with 1

*** mutation diff:
--- crates/ccog/src/admit.rs
+++ replace bool_mask -> u64 with 1
@@ -39,17 +39,17 @@
 ///
 /// ```ignore
 /// assert_eq!(admit::bool_mask(true), 0);
 /// assert_eq!(admit::bool_mask(false), u64::MAX);
 /// ```
 #[must_use]
 #[inline(always)]
 pub const fn bool_mask(condition: bool) -> u64 {
-    0u64.wrapping_sub((!condition) as u64)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Composes two admission verdicts via bitwise OR.
 ///
 /// The result is admitted (`0`) iff *both* inputs are admitted; otherwise the
 /// denial bits propagate.
 #[must_use]
 #[inline(always)]

---- admit::tests::commit_masked_bool_selects_correctly stdout ----

thread 'admit::tests::commit_masked_bool_selects_correctly' (8635144) panicked at crates/ccog/src/admit.rs:209:9:
assertion failed: commit_masked_bool(0, true, false)

---- admit::tests::commit_masked_u64_selects_value_when_admitted stdout ----

thread 'admit::tests::commit_masked_u64_selects_value_when_admitted' (8635147) panicked at crates/ccog/src/admit.rs:193:9:
assertion `left == right` failed
  left: 43
 right: 42

---- admit::tests::bool_mask_denied_is_all_ones stdout ----

thread 'admit::tests::bool_mask_denied_is_all_ones' (8635143) panicked at crates/ccog/src/admit.rs:151:9:
assertion `left == right` failed
  left: 1
 right: 18446744073709551615

failures:
    admit::tests::bool_mask_admitted_is_zero
    admit::tests::bool_mask_denied_is_all_ones
    admit::tests::commit_masked_bool_selects_correctly
    admit::tests::commit_masked_u64_selects_fallback_when_denied
    admit::tests::commit_masked_u64_selects_value_when_admitted
    bark_artifact::tests::missing_evidence_emits_ask_action_not_placeholder
    bark_artifact::tests::phrase_binding_emits_was_informed_by
    bark_artifact::tests::transition_emits_prov_activity_not_shacl_shape
    construct8::tests::push_to_capacity_succeeds
    construct8::tests::to_ntriples_valid
    hooks::tests::missing_evidence_hook_emits_ask_action_not_placeholder
    hooks::tests::missing_evidence_hook_fires_on_gap

test result: FAILED. 197 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
