*** crates/ccog/src/admit.rs:57:7: replace | with & in admit2

*** mutation diff:
--- crates/ccog/src/admit.rs
+++ replace | with & in admit2
@@ -49,17 +49,17 @@
 
 /// Composes two admission verdicts via bitwise OR.
 ///
 /// The result is admitted (`0`) iff *both* inputs are admitted; otherwise the
 /// denial bits propagate.
 #[must_use]
 #[inline(always)]
 pub const fn admit2(a: u64, b: u64) -> u64 {
-    a | b
+    a & /* ~ changed by cargo-mutants ~ */ b
 }
 
 /// Composes three admission verdicts via bitwise OR.
 ///
 /// The result is admitted (`0`) iff *all three* inputs are admitted.
 #[must_use]
 #[inline(always)]
 pub const fn admit3(a: u64, b: u64, c: u64) -> u64 {

---- admit::tests::admit2_admits_when_both_zero stdout ----

thread 'admit::tests::admit2_admits_when_both_zero' (8651865) panicked at crates/ccog/src/admit.rs:158:9:
assertion `left != right` failed
  left: 0
 right: 0

failures:
    admit::tests::admit2_admits_when_both_zero

test result: FAILED. 216 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.72s

*** result: Failure(101)
