*** crates/ccog/src/admit.rs:66:11: replace | with ^ in admit3

*** mutation diff:
--- crates/ccog/src/admit.rs
+++ replace | with ^ in admit3
@@ -58,17 +58,17 @@
 }
 
 /// Composes three admission verdicts via bitwise OR.
 ///
 /// The result is admitted (`0`) iff *all three* inputs are admitted.
 #[must_use]
 #[inline(always)]
 pub const fn admit3(a: u64, b: u64, c: u64) -> u64 {
-    a | b | c
+    a | b ^ /* ~ changed by cargo-mutants ~ */ c
 }
 
 /// Composes four admission verdicts via bitwise OR.
 ///
 /// The result is admitted (`0`) iff *all four* inputs are admitted.
 #[must_use]
 #[inline(always)]
 pub const fn admit4(a: u64, b: u64, c: u64, d: u64) -> u64 {

*** result: Success
