*** crates/ccog/src/admit.rs:66:5: replace admit3 -> u64 with 1

*** mutation diff:
--- crates/ccog/src/admit.rs
+++ replace admit3 -> u64 with 1
@@ -58,17 +58,17 @@
 }
 
 /// Composes three admission verdicts via bitwise OR.
 ///
 /// The result is admitted (`0`) iff *all three* inputs are admitted.
 #[must_use]
 #[inline(always)]
 pub const fn admit3(a: u64, b: u64, c: u64) -> u64 {
-    a | b | c
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Composes four admission verdicts via bitwise OR.
 ///
 /// The result is admitted (`0`) iff *all four* inputs are admitted.
 #[must_use]
 #[inline(always)]
 pub const fn admit4(a: u64, b: u64, c: u64, d: u64) -> u64 {

---- admit::tests::admit3_composes_via_or stdout ----

thread 'admit::tests::admit3_composes_via_or' (8665282) panicked at crates/ccog/src/admit.rs:166:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    admit::tests::admit3_composes_via_or

test result: FAILED. 216 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.59s

*** result: Failure(101)
