*** crates/ccog/src/admit.rs:66:7: replace | with & in admit3

*** mutation diff:
--- crates/ccog/src/admit.rs
+++ replace | with & in admit3
@@ -58,17 +58,17 @@
 }
 
 /// Composes three admission verdicts via bitwise OR.
 ///
 /// The result is admitted (`0`) iff *all three* inputs are admitted.
 #[must_use]
 #[inline(always)]
 pub const fn admit3(a: u64, b: u64, c: u64) -> u64 {
-    a | b | c
+    a & /* ~ changed by cargo-mutants ~ */ b | c
 }
 
 /// Composes four admission verdicts via bitwise OR.
 ///
 /// The result is admitted (`0`) iff *all four* inputs are admitted.
 #[must_use]
 #[inline(always)]
 pub const fn admit4(a: u64, b: u64, c: u64, d: u64) -> u64 {

---- admit::tests::admit3_composes_via_or stdout ----

thread 'admit::tests::admit3_composes_via_or' (8678614) panicked at crates/ccog/src/admit.rs:167:9:
assertion `left == right` failed
  left: 4
 right: 7

failures:
    admit::tests::admit3_composes_via_or

test result: FAILED. 216 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.60s

*** result: Failure(101)
