*** crates/ccog/src/admit.rs:75:5: replace admit4 -> u64 with 1

*** mutation diff:
--- crates/ccog/src/admit.rs
+++ replace admit4 -> u64 with 1
@@ -67,17 +67,17 @@
 }
 
 /// Composes four admission verdicts via bitwise OR.
 ///
 /// The result is admitted (`0`) iff *all four* inputs are admitted.
 #[must_use]
 #[inline(always)]
 pub const fn admit4(a: u64, b: u64, c: u64, d: u64) -> u64 {
-    a | b | c | d
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Returns `true` iff `verdict == 0` (i.e. the verdict is admitted).
 ///
 /// This is the only place that converts a denial-polarity bitmask back into
 /// the `bool` world. Callers should compose admissions with `admit2`/`admit3`
 /// /`admit4` and keep the bitmask form as long as possible.
 #[must_use]

---- admit::tests::admit4_composes_via_or stdout ----

thread 'admit::tests::admit4_composes_via_or' (8691933) panicked at crates/ccog/src/admit.rs:175:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    admit::tests::admit4_composes_via_or

test result: FAILED. 216 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.57s

*** result: Failure(101)
