*** crates/ccog/src/admit.rs:75:7: replace | with & in admit4

*** mutation diff:
--- crates/ccog/src/admit.rs
+++ replace | with & in admit4
@@ -67,17 +67,17 @@
 }
 
 /// Composes four admission verdicts via bitwise OR.
 ///
 /// The result is admitted (`0`) iff *all four* inputs are admitted.
 #[must_use]
 #[inline(always)]
 pub const fn admit4(a: u64, b: u64, c: u64, d: u64) -> u64 {
-    a | b | c | d
+    a & /* ~ changed by cargo-mutants ~ */ b | c | d
 }
 
 /// Returns `true` iff `verdict == 0` (i.e. the verdict is admitted).
 ///
 /// This is the only place that converts a denial-polarity bitmask back into
 /// the `bool` world. Callers should compose admissions with `admit2`/`admit3`
 /// /`admit4` and keep the bitmask form as long as possible.
 #[must_use]

---- admit::tests::admit4_composes_via_or stdout ----

thread 'admit::tests::admit4_composes_via_or' (8714489) panicked at crates/ccog/src/admit.rs:176:9:
assertion `left == right` failed
  left: 12
 right: 15

failures:
    admit::tests::admit4_composes_via_or

test result: FAILED. 216 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
