*** crates/ccog/src/admit.rs:86:13: replace == with != in admitted

*** mutation diff:
--- crates/ccog/src/admit.rs
+++ replace == with != in admitted
@@ -78,17 +78,17 @@
 /// Returns `true` iff `verdict == 0` (i.e. the verdict is admitted).
 ///
 /// This is the only place that converts a denial-polarity bitmask back into
 /// the `bool` world. Callers should compose admissions with `admit2`/`admit3`
 /// /`admit4` and keep the bitmask form as long as possible.
 #[must_use]
 #[inline(always)]
 pub const fn admitted(verdict: u64) -> bool {
-    verdict == 0
+    verdict != /* ~ changed by cargo-mutants ~ */ 0
 }
 
 /// Branchless select between two `u64` values driven by `verdict`.
 ///
 /// Returns `value` when `verdict` is admitted (`0`), and `fallback` otherwise.
 /// The selection is performed via mask arithmetic with no conditional jumps:
 ///
 /// ```text

---- admit::tests::commit_masked_generic_selects_correctly stdout ----

thread 'admit::tests::commit_masked_generic_selects_correctly' (8732272) panicked at crates/ccog/src/admit.rs:222:9:
assertion `left == right` failed
  left: (9, 8)
 right: (1, 2)

---- admit::tests::commit_masked_bool_selects_correctly stdout ----

thread 'admit::tests::commit_masked_bool_selects_correctly' (8732271) panicked at crates/ccog/src/admit.rs:209:9:
assertion failed: commit_masked_bool(0, true, false)

---- admit::tests::admitted_returns_true_only_for_zero stdout ----

thread 'admit::tests::admitted_returns_true_only_for_zero' (8732268) panicked at crates/ccog/src/admit.rs:184:9:
assertion failed: admitted(0)

failures:
    admit::tests::admitted_returns_true_only_for_zero
    admit::tests::commit_masked_bool_selects_correctly
    admit::tests::commit_masked_generic_selects_correctly
    admit::tests::commit_masked_u64_selects_fallback_when_denied
    admit::tests::commit_masked_u64_selects_value_when_admitted
    bark_artifact::tests::missing_evidence_emits_ask_action_not_placeholder
    bark_artifact::tests::phrase_binding_emits_was_informed_by
    bark_artifact::tests::transition_emits_prov_activity_not_shacl_shape
    construct8::tests::push_to_capacity_succeeds
    construct8::tests::to_ntriples_valid
    hooks::tests::missing_evidence_hook_emits_ask_action_not_placeholder
    hooks::tests::missing_evidence_hook_fires_on_gap

test result: FAILED. 196 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
