*** crates/ccog/src/admit.rs:86:5: replace admitted -> bool with true

*** mutation diff:
--- crates/ccog/src/admit.rs
+++ replace admitted -> bool with true
@@ -78,17 +78,17 @@
 /// Returns `true` iff `verdict == 0` (i.e. the verdict is admitted).
 ///
 /// This is the only place that converts a denial-polarity bitmask back into
 /// the `bool` world. Callers should compose admissions with `admit2`/`admit3`
 /// /`admit4` and keep the bitmask form as long as possible.
 #[must_use]
 #[inline(always)]
 pub const fn admitted(verdict: u64) -> bool {
-    verdict == 0
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Branchless select between two `u64` values driven by `verdict`.
 ///
 /// Returns `value` when `verdict` is admitted (`0`), and `fallback` otherwise.
 /// The selection is performed via mask arithmetic with no conditional jumps:
 ///
 /// ```text

---- admit::tests::commit_masked_bool_selects_correctly stdout ----

thread 'admit::tests::commit_masked_bool_selects_correctly' (8723964) panicked at crates/ccog/src/admit.rs:211:9:
assertion failed: !commit_masked_bool(1, true, false)

---- admit::tests::commit_masked_generic_selects_correctly stdout ----

thread 'admit::tests::commit_masked_generic_selects_correctly' (8723965) panicked at crates/ccog/src/admit.rs:223:9:
assertion `left == right` failed
  left: (1, 2)
 right: (9, 8)

---- admit::tests::commit_masked_u64_selects_fallback_when_denied stdout ----

thread 'admit::tests::commit_masked_u64_selects_fallback_when_denied' (8723966) panicked at crates/ccog/src/admit.rs:201:9:
assertion `left == right` failed
  left: 42
 right: 99

failures:
    admit::tests::admitted_returns_true_only_for_zero
    admit::tests::commit_masked_bool_selects_correctly
    admit::tests::commit_masked_generic_selects_correctly
    admit::tests::commit_masked_u64_selects_fallback_when_denied
    construct8::tests::push_to_capacity_succeeds
    hooks::tests::snapshot_admit_check_dispatches

test result: FAILED. 211 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.59s

*** result: Failure(101)
