*** crates/ccog/src/bin/dendral.rs:123:53: replace != with == in run

*** mutation diff:
--- crates/ccog/src/bin/dendral.rs
+++ replace != with == in run
@@ -115,17 +115,17 @@
             let bytes = fs::read(&trace)?;
             let _v: serde_json::Value = serde_json::from_slice(&bytes)
                 .map_err(|e| anyhow::anyhow!("trace.jsonld is not valid JSON: {}", e))?;
             println!("replay: trace JSON parsed; full Phase 7 replay pending Writer-7");
             Ok(())
         }
         Cmd::Path { chain_head, field } => {
             let bytes = fs::read(&field)?;
-            if bytes.is_empty() || bytes.len() % 32 != 0 {
+            if bytes.is_empty() || bytes.len() % 32 == /* ~ changed by cargo-mutants ~ */ 0 {
                 anyhow::bail!("path file is empty or not 32-byte aligned");
             }
             let tail = &bytes[bytes.len() - 32..];
             let hex_actual = blake3_hex(tail);
             if hex_actual.eq_ignore_ascii_case(&chain_head) {
                 println!("path: chain head matches ({} entries)", bytes.len() / 32);
                 Ok(())
             } else {

*** result: Success
