*** crates/ccog/src/bin/dendral.rs:94:5: replace run -> anyhow::Result<()> with Ok(())

*** mutation diff:
--- crates/ccog/src/bin/dendral.rs
+++ replace run -> anyhow::Result<()> with Ok(())
@@ -86,88 +86,17 @@
         Err(e) => {
             eprintln!("dendral: {}", e);
             ExitCode::from(1)
         }
     }
 }
 
 fn run(cli: Cli) -> anyhow::Result<()> {
-    match cli.cmd {
-        Cmd::Reconstruct { urn, field: _ } => {
-            // Phase 7 dependency: reconstructing a snapshot for an arbitrary
-            // URN requires the trace history Writer-7 will provide. Until
-            // then, echo the URN and exit cleanly. (Boundary detector test
-            // does not exercise this branch.)
-            println!("reconstruct: {}", urn);
-            Ok(())
-        }
-        Cmd::Verify { bundle, field: _ } => {
-            let bytes = fs::read(&bundle)?;
-            let verdict = verify_bundle_bytes(&bytes, &[], None)
-                .map_err(|e| anyhow::anyhow!("replay error: {}", e))?;
-            print_verdict(&verdict);
-            if verdict.all_intact() {
-                Ok(())
-            } else {
-                anyhow::bail!("bundle verification failed");
-            }
-        }
-        Cmd::Replay { trace, field: _ } => {
-            let bytes = fs::read(&trace)?;
-            let _v: serde_json::Value = serde_json::from_slice(&bytes)
-                .map_err(|e| anyhow::anyhow!("trace.jsonld is not valid JSON: {}", e))?;
-            println!("replay: trace JSON parsed; full Phase 7 replay pending Writer-7");
-            Ok(())
-        }
-        Cmd::Path { chain_head, field } => {
-            let bytes = fs::read(&field)?;
-            if bytes.is_empty() || bytes.len() % 32 != 0 {
-                anyhow::bail!("path file is empty or not 32-byte aligned");
-            }
-            let tail = &bytes[bytes.len() - 32..];
-            let hex_actual = blake3_hex(tail);
-            if hex_actual.eq_ignore_ascii_case(&chain_head) {
-                println!("path: chain head matches ({} entries)", bytes.len() / 32);
-                Ok(())
-            } else {
-                anyhow::bail!(
-                    "chain head mismatch: declared {}, actual {}",
-                    chain_head,
-                    hex_actual
-                );
-            }
-        }
-        Cmd::Bundle {
-            input,
-            out,
-            tier,
-            sign: _sign,
-        } => {
-            let trace = fs::read(input.join("trace.jsonld"))?;
-            let receipt = fs::read(input.join("receipt.jsonld"))?;
-            let path = fs::read(input.join("powl64-path.bin"))?;
-            let refs_path = input.join("ontology-refs.txt");
-            let refs = if refs_path.exists() {
-                fs::read_to_string(&refs_path)?
-                    .lines()
-                    .filter(|l| !l.is_empty())
-                    .map(str::to_string)
-                    .collect()
-            } else {
-                Vec::new()
-            };
-            let tier = parse_tier(&tier)?;
-            let bundle = ProofBundle::build(trace, receipt, path, refs, tier);
-            let bytes = bundle.write().map_err(|e| anyhow::anyhow!("write: {}", e))?;
-            fs::write(&out, bytes)?;
-            println!("bundle: wrote {}", out.display());
-            Ok(())
-        }
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_tier(s: &str) -> anyhow::Result<BenchmarkTier> {
     Ok(match s {
         "KernelFloor" => BenchmarkTier::KernelFloor,
         "CompiledBark" => BenchmarkTier::CompiledBark,
         "Materialization" => BenchmarkTier::Materialization,
         "ReceiptPath" => BenchmarkTier::ReceiptPath,

*** result: Success
