*** crates/ccog/src/packs/mod.rs:293:12: delete ! in load_compiled

*** mutation diff:
--- crates/ccog/src/packs/mod.rs
+++ delete ! in load_compiled
@@ -285,17 +285,17 @@
 
     // Validate ontology profile non-empty.
     if ontology_profile.is_empty() {
         return Err(PackLoadError::MissingOntologyProfile);
     }
 
     // Validate all ontology IRIs are public-only.
     for iri in ontology_profile {
-        if !iri_is_public(iri) {
+        if  /* ~ changed by cargo-mutants ~ */iri_is_public(iri) {
             return Err(PackLoadError::PrivateOntologyTerm(iri.clone()));
         }
     }
 
     // Enforce cryptographic admission (Phase 3).
     // Recompute the BLAKE3 digest of the load-bearing content.
     let recomputed_hash = compute_manifest_digest(name, ontology_profile, rules);
     let expected_urn = format!("urn:blake3:{}", recomputed_hash.to_hex());

---- packs::tests::load_compiled_admits_valid_digest stdout ----

thread 'packs::tests::load_compiled_admits_valid_digest' (8813469) panicked at crates/ccog/src/packs/mod.rs:545:9:
should admit valid digest: Some(PrivateOntologyTerm("https://schema.org/"))

---- packs::tests::load_compiled_rejects_tampered_digest stdout ----

thread 'packs::tests::load_compiled_rejects_tampered_digest' (8813471) panicked at crates/ccog/src/packs/mod.rs:557:9:
should reject tampered digest: Err(PrivateOntologyTerm("https://schema.org/"))

---- packs::tests::load_compiled_rejects_tampered_content stdout ----

thread 'packs::tests::load_compiled_rejects_tampered_content' (8813470) panicked at crates/ccog/src/packs/mod.rs:576:9:
should reject tampered content: Err(PrivateOntologyTerm("https://schema.org/"))

failures:
    packs::tests::load_compiled_admits_valid_digest
    packs::tests::load_compiled_rejects_tampered_content
    packs::tests::load_compiled_rejects_tampered_digest

test result: FAILED. 214 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.57s

*** result: Failure(101)
