*** crates/ccog/src/packs/mod.rs:303:19: replace != with == in load_compiled

*** mutation diff:
--- crates/ccog/src/packs/mod.rs
+++ replace != with == in load_compiled
@@ -295,17 +295,17 @@
         }
     }
 
     // Enforce cryptographic admission (Phase 3).
     // Recompute the BLAKE3 digest of the load-bearing content.
     let recomputed_hash = compute_manifest_digest(name, ontology_profile, rules);
     let expected_urn = format!("urn:blake3:{}", recomputed_hash.to_hex());
 
-    if digest_urn != expected_urn {
+    if digest_urn == /* ~ changed by cargo-mutants ~ */ expected_urn {
         return Err(PackLoadError::ManifestTamper(format!(
             "declared {}, recomputed {}",
             digest_urn, expected_urn
         )));
     }
 
     // Create loaded pack.
     Ok(LoadedFieldPack {

---- packs::tests::load_compiled_admits_valid_digest stdout ----

thread 'packs::tests::load_compiled_admits_valid_digest' (8817604) panicked at crates/ccog/src/packs/mod.rs:545:9:
should admit valid digest: Some(ManifestTamper("declared urn:blake3:49a6b5b7cfd101216678c514db53ef87f0f5b6935c991e1f5ec15e700d908a6d, recomputed urn:blake3:49a6b5b7cfd101216678c514db53ef87f0f5b6935c991e1f5ec15e700d908a6d"))

---- packs::tests::load_compiled_rejects_tampered_content stdout ----

thread 'packs::tests::load_compiled_rejects_tampered_content' (8817605) panicked at crates/ccog/src/packs/mod.rs:576:9:

---- packs::tests::load_compiled_rejects_tampered_digest stdout ----

thread 'packs::tests::load_compiled_rejects_tampered_digest' (8817606) panicked at crates/ccog/src/packs/mod.rs:557:9:

failures:
    packs::tests::load_compiled_admits_valid_digest
    packs::tests::load_compiled_rejects_tampered_content
    packs::tests::load_compiled_rejects_tampered_digest

test result: FAILED. 214 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.57s

*** result: Failure(101)
