*** crates/ccog/src/packs/mod.rs:380:45: replace + with * in validate

*** mutation diff:
--- crates/ccog/src/packs/mod.rs
+++ replace + with * in validate
@@ -372,17 +372,17 @@
                     "overlapping bit requirements between `{}` and `{}` with conflicting responses",
                     r1.id, r2.id
                 )));
             }
         }
     }
     // 2. Validate group ids unique and ranks distinct.
     for (i, g1) in pack.groups.iter().enumerate() {
-        for g2 in pack.groups.iter().skip(i + 1) {
+        for g2 in pack.groups.iter().skip(i * /* ~ changed by cargo-mutants ~ */ 1) {
             if g1.id == g2.id {
                 return Err(PackLoadError::ValidationFailed(format!(
                     "duplicate group id: {}",
                     g1.id
                 )));
             }
             if g1.precedence_rank == g2.precedence_rank {
                 return Err(PackLoadError::ValidationFailed(format!(

---- packs::lifestyle_overlap::tests::pack_validates_clean stdout ----

thread 'packs::lifestyle_overlap::tests::pack_validates_clean' (8849230) panicked at crates/ccog/src/packs/lifestyle_overlap.rs:274:22:
Phase 7.1 lifestyle pack must validate: ValidationFailed("duplicate group id: lifestyle.safety")

failures:
    packs::lifestyle_overlap::tests::pack_validates_clean

test result: FAILED. 216 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.62s

*** result: Failure(101)
