*** crates/ccog/src/packs/mod.rs:387:35: replace == with != in validate

*** mutation diff:
--- crates/ccog/src/packs/mod.rs
+++ replace == with != in validate
@@ -379,17 +379,17 @@
     for (i, g1) in pack.groups.iter().enumerate() {
         for g2 in pack.groups.iter().skip(i + 1) {
             if g1.id == g2.id {
                 return Err(PackLoadError::ValidationFailed(format!(
                     "duplicate group id: {}",
                     g1.id
                 )));
             }
-            if g1.precedence_rank == g2.precedence_rank {
+            if g1.precedence_rank != /* ~ changed by cargo-mutants ~ */ g2.precedence_rank {
                 return Err(PackLoadError::ValidationFailed(format!(
                     "duplicate precedence_rank {} between groups `{}` and `{}`",
                     g1.precedence_rank, g1.id, g2.id
                 )));
             }
         }
     }
     // 3. Validate rules within each group amongst themselves.

---- packs::lifestyle_overlap::tests::pack_validates_clean stdout ----

thread 'packs::lifestyle_overlap::tests::pack_validates_clean' (8857600) panicked at crates/ccog/src/packs/lifestyle_overlap.rs:274:22:
Phase 7.1 lifestyle pack must validate: ValidationFailed("duplicate precedence_rank 10 between groups `lifestyle.safety` and `lifestyle.evidence`")

failures:
    packs::lifestyle_overlap::tests::pack_validates_clean

test result: FAILED. 216 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.62s

*** result: Failure(101)
