*** crates/ccog/src/packs/mod.rs:399:26: replace == with != in validate

*** mutation diff:
--- crates/ccog/src/packs/mod.rs
+++ replace == with != in validate
@@ -391,17 +391,17 @@
                 )));
             }
         }
     }
     // 3. Validate rules within each group amongst themselves.
     for g in &pack.groups {
         for (i, r1) in g.rules.iter().enumerate() {
             for r2 in g.rules.iter().skip(i + 1) {
-                if r1.id == r2.id {
+                if r1.id != /* ~ changed by cargo-mutants ~ */ r2.id {
                     return Err(PackLoadError::ValidationFailed(format!(
                         "duplicate rule id `{}` in group `{}`",
                         r1.id, g.id
                     )));
                 }
                 if rules_overlap_with_conflicting_responses(r1, r2) {
                     return Err(PackLoadError::ValidationFailed(format!(
                         "overlapping bit requirements in group `{}` between `{}` and `{}` with conflicting responses",

---- packs::lifestyle_overlap::tests::pack_validates_clean stdout ----

thread 'packs::lifestyle_overlap::tests::pack_validates_clean' (8870153) panicked at crates/ccog/src/packs/lifestyle_overlap.rs:274:22:
Phase 7.1 lifestyle pack must validate: ValidationFailed("duplicate rule id `lifestyle.safety.driving_risk_refuses` in group `lifestyle.safety`")

failures:
    packs::lifestyle_overlap::tests::pack_validates_clean

test result: FAILED. 216 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.59s

*** result: Failure(101)
