*** crates/ccog/src/packs/mod.rs:419:5: replace rules_overlap_with_conflicting_responses -> bool with false

*** mutation diff:
--- crates/ccog/src/packs/mod.rs
+++ replace rules_overlap_with_conflicting_responses -> bool with false
@@ -411,24 +411,17 @@
             }
         }
     }
     Ok(())
 }
 
 #[inline]
 fn rules_overlap_with_conflicting_responses(r1: &LoadedPackRule, r2: &LoadedPackRule) -> bool {
-    let overlap = (r1.require_posture_mask & r2.require_posture_mask)
-        | (r1.require_expectation_mask & r2.require_expectation_mask)
-        | (r1.require_risk_mask & r2.require_risk_mask)
-        | (r1.require_affordance_mask & r2.require_affordance_mask)
-        | (r1.require_k1_mask & r2.require_k1_mask)
-        | (r1.require_k2_mask & r2.require_k2_mask)
-        | (r1.require_k3_mask & r2.require_k3_mask);
-    overlap != 0 && r1.response != r2.response
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Subset match: every set bit in `require` must also be set in `actual`.
 #[inline]
 const fn mask_satisfies(actual: u64, require: u64) -> bool {
     (actual & require) == require
 }

*** result: Success
