*** crates/ccog/src/packs/mod.rs:421:33: replace & with | in rules_overlap_with_conflicting_responses

*** mutation diff:
--- crates/ccog/src/packs/mod.rs
+++ replace & with | in rules_overlap_with_conflicting_responses
@@ -413,17 +413,17 @@
     }
     Ok(())
 }
 
 #[inline]
 fn rules_overlap_with_conflicting_responses(r1: &LoadedPackRule, r2: &LoadedPackRule) -> bool {
     let overlap = (r1.require_posture_mask & r2.require_posture_mask)
         | (r1.require_expectation_mask & r2.require_expectation_mask)
-        | (r1.require_risk_mask & r2.require_risk_mask)
+        | (r1.require_risk_mask | /* ~ changed by cargo-mutants ~ */ r2.require_risk_mask)
         | (r1.require_affordance_mask & r2.require_affordance_mask)
         | (r1.require_k1_mask & r2.require_k1_mask)
         | (r1.require_k2_mask & r2.require_k2_mask)
         | (r1.require_k3_mask & r2.require_k3_mask);
     overlap != 0 && r1.response != r2.response
 }
 
 /// Subset match: every set bit in `require` must also be set in `actual`.

*** result: Success
