*** crates/ccog/src/packs/mod.rs:425:31: replace & with ^ in rules_overlap_with_conflicting_responses

*** mutation diff:
--- crates/ccog/src/packs/mod.rs
+++ replace & with ^ in rules_overlap_with_conflicting_responses
@@ -417,17 +417,17 @@
 #[inline]
 fn rules_overlap_with_conflicting_responses(r1: &LoadedPackRule, r2: &LoadedPackRule) -> bool {
     let overlap = (r1.require_posture_mask & r2.require_posture_mask)
         | (r1.require_expectation_mask & r2.require_expectation_mask)
         | (r1.require_risk_mask & r2.require_risk_mask)
         | (r1.require_affordance_mask & r2.require_affordance_mask)
         | (r1.require_k1_mask & r2.require_k1_mask)
         | (r1.require_k2_mask & r2.require_k2_mask)
-        | (r1.require_k3_mask & r2.require_k3_mask);
+        | (r1.require_k3_mask ^ /* ~ changed by cargo-mutants ~ */ r2.require_k3_mask);
     overlap != 0 && r1.response != r2.response
 }
 
 /// Subset match: every set bit in `require` must also be set in `actual`.
 #[inline]
 const fn mask_satisfies(actual: u64, require: u64) -> bool {
     (actual & require) == require
 }

---- packs::lifestyle_overlap::tests::pack_validates_clean stdout ----

thread 'packs::lifestyle_overlap::tests::pack_validates_clean' (9023426) panicked at crates/ccog/src/packs/lifestyle_overlap.rs:274:22:
Phase 7.1 lifestyle pack must validate: ValidationFailed("overlapping bit requirements in group `lifestyle.evidence` between `lifestyle.evidence.missing_completion_asks` and `lifestyle.evidence.routine_uncertain_inspects` with conflicting responses")

failures:
    packs::lifestyle_overlap::tests::pack_validates_clean

test result: FAILED. 216 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.60s

*** result: Failure(101)
