*** crates/ccog/src/packs/mod.rs:88:5: replace iri_is_public -> bool with true

*** mutation diff:
--- crates/ccog/src/packs/mod.rs
+++ replace iri_is_public -> bool with true
@@ -80,19 +80,17 @@
     "https://schema.org/",
     "urn:blake3:",
     "urn:ccog:vocab:",
 ];
 
 /// True iff `iri` starts with any prefix in [`PUBLIC_ONTOLOGY_PREFIXES`].
 #[must_use]
 pub fn iri_is_public(iri: &str) -> bool {
-    PUBLIC_ONTOLOGY_PREFIXES
-        .iter()
-        .any(|p| iri.starts_with(p))
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 // =============================================================================
 // KZ7B: Runtime Pack Loading Infrastructure
 // =============================================================================
 
 /// Error type for pack loading failures.
 #[derive(Clone, Debug, PartialEq, Eq)]

---- packs::tests::iri_is_public_rejects_unknown_namespace stdout ----

thread 'packs::tests::iri_is_public_rejects_unknown_namespace' (8787946) panicked at crates/ccog/src/packs/mod.rs:531:9:
assertion failed: !iri_is_public("http://internal.acme.example/foo")

failures:
    packs::tests::iri_is_public_rejects_unknown_namespace

test result: FAILED. 216 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
