*** crates/ccog/src/packs/mod.rs:88:5: replace iri_is_public -> bool with false

*** mutation diff:
--- crates/ccog/src/packs/mod.rs
+++ replace iri_is_public -> bool with false
@@ -80,19 +80,17 @@
     "https://schema.org/",
     "urn:blake3:",
     "urn:ccog:vocab:",
 ];
 
 /// True iff `iri` starts with any prefix in [`PUBLIC_ONTOLOGY_PREFIXES`].
 #[must_use]
 pub fn iri_is_public(iri: &str) -> bool {
-    PUBLIC_ONTOLOGY_PREFIXES
-        .iter()
-        .any(|p| iri.starts_with(p))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 // =============================================================================
 // KZ7B: Runtime Pack Loading Infrastructure
 // =============================================================================
 
 /// Error type for pack loading failures.
 #[derive(Clone, Debug, PartialEq, Eq)]

---- packs::tests::load_compiled_admits_valid_digest stdout ----

thread 'packs::tests::load_compiled_admits_valid_digest' (8792184) panicked at crates/ccog/src/packs/mod.rs:543:9:
should admit valid digest: Some(PrivateOntologyTerm("https://schema.org/"))

---- packs::tests::load_compiled_rejects_tampered_digest stdout ----

thread 'packs::tests::load_compiled_rejects_tampered_digest' (8792186) panicked at crates/ccog/src/packs/mod.rs:555:9:
should reject tampered digest: Err(PrivateOntologyTerm("https://schema.org/"))

---- packs::tests::load_compiled_rejects_tampered_content stdout ----

thread 'packs::tests::load_compiled_rejects_tampered_content' (8792185) panicked at crates/ccog/src/packs/mod.rs:574:9:
should reject tampered content: Err(PrivateOntologyTerm("https://schema.org/"))

failures:
    packs::tests::iri_is_public_accepts_blake3
    packs::tests::load_compiled_admits_valid_digest
    packs::tests::load_compiled_rejects_tampered_content
    packs::tests::load_compiled_rejects_tampered_digest

test result: FAILED. 213 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.59s

*** result: Failure(101)
